In [1]:
#Creating a Series from a List
import pandas as pd

data = [1, 2, 3, 4, 5]
series_from_list = pd.Series(data)
print(series_from_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
#creatig a series from dictionary

data = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
series_from_dict = pd.Series(data)
print(series_from_dict)

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
#Creating a Series from a Scalar Value
scalar_value = 5
series_from_scalar = pd.Series(scalar_value, index=[0, 1, 2, 3, 4])
print(series_from_scalar)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [4]:
#Creating a Series from a Numpy Array
import numpy as np

data = np.array([1, 2, 3, 4, 5])
series_from_array = pd.Series(data)
print(series_from_array)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [5]:
#Creating a Series with a Custom Index
data = [1, 2, 3, 4, 5]
custom_index = ['a', 'b', 'c', 'd', 'e']
series_with_custom_index = pd.Series(data, index=custom_index)
print(series_with_custom_index)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
#Creating a DataFrame from a Dictionary of Lists
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}
df_from_dict_of_lists = pd.DataFrame(data)
print(df_from_dict_of_lists)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [7]:
#Creating a DataFrame from a Dictionary of Series
data = {
    'Name': pd.Series(['Alice', 'Bob', 'Charlie']),
    'Age': pd.Series([25, 30, 35]),
    'City': pd.Series(['New York', 'San Francisco', 'Los Angeles'])
}
df_from_dict_of_series = pd.DataFrame(data)
print(df_from_dict_of_series)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [8]:
# Creating a DataFrame from a NumPy Array
import numpy as np

data = np.array([
    [25, 'New York'],
    [30, 'San Francisco'],
    [35, 'Los Angeles']
])
df_from_array = pd.DataFrame(data, columns=['Age', 'City'])
print(df_from_array)

  Age           City
0  25       New York
1  30  San Francisco
2  35    Los Angeles

In [9]:
# Creating a DataFrame from a CSV File
df_from_csv = pd.read_csv('C:/Users/Harsha/Downloads/iris.csv')
print(df_from_csv)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [10]:
#Using loc & iloc
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}
df = pd.DataFrame(data)

In [11]:
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [12]:
# Access a single value using loc
age_of_bob = df.loc[1, 'Age']
print(age_of_bob)

30

In [13]:
# Access multiple rows and columns using loc
subset = df.loc[1:2, ['Name', 'City']]
print(subset)

      Name           City
1      Bob  San Francisco
2  Charlie    Los Angeles

In [14]:
# Conditional selection using loc
older_than_30 = df.loc[df['Age'] > 30]
print(older_than_30)

      Name  Age         City
2  Charlie   35  Los Angeles

In [15]:
# Access a single value using iloc
age_of_bob = df.iloc[1, 1]
print(age_of_bob)

30

In [17]:
# Access multiple rows and columns using iloc
subset = df.iloc[1:3, 0:2]
print(subset)

      Name  Age
1      Bob   30
2  Charlie   35

In [20]:
# Access multiple rows and columns using iloc
subset = df.iloc[1:3, 0:2]
print(subset)

      Name  Age
1      Bob   30
2  Charlie   35

In [21]:
#statistical functions in pandas
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'Salary': [50000, 60000, 70000, 80000, 90000]
}
df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4      Eve   45   90000

In [23]:
#Summary statistics for the entire DataFrame
summary_stats=df.describe()
print(summary_stats)

             Age        Salary
count   5.000000      5.000000
mean   35.000000  70000.000000
std     7.905694  15811.388301
min    25.000000  50000.000000
25%    30.000000  60000.000000
50%    35.000000  70000.000000
75%    40.000000  80000.000000
max    45.000000  90000.000000

In [24]:
# Summary statistics for a specific column
summary_stats_age = df['Age'].describe()
print(summary_stats_age)

count     5.000000
mean     35.000000
std       7.905694
min      25.000000
25%      30.000000
50%      35.000000
75%      40.000000
max      45.000000
Name: Age, dtype: float64

In [25]:
# Mean
mean_age = df['Age'].mean()
print(f"Mean Age: {mean_age}")

# Median
median_salary = df['Salary'].median()
print(f"Median Salary: {median_salary}")

# Mode
mode_age = df['Age'].mode()
print(f"Mode Age: {mode_age}")

Mean Age: 35.0
Median Salary: 70000.0
Mode Age: 0    25
1    30
2    35
3    40
4    45
Name: Age, dtype: int64

In [28]:
# Sum
total_salary = df['Salary'].sum()
print(f"Total Salary: {total_salary}")

# Minimum
min_age = df['Age'].min()
print(f"Minimum Age: {min_age}")

# Maximum
max_age = df['Age'].max()
print(f"Maximum Age: {max_age}")

Total Salary: 350000
Minimum Age: 25
Maximum Age: 45

In [29]:
# Standard Deviation
std_age = df['Age'].std()
print(std_age)

# Variance
var_salary = df['Salary'].var()
print(f"Variance of Salary: {var_salary}")

7.905694150420948
Variance of Salary: 250000000.0

In [30]:
# Applying multiple functions
aggregated_stats = df.agg({
    'Age': ['mean', 'min', 'max'],
    'Salary': ['sum', 'std']
})
print("Aggregated statistics:\n", aggregated_stats)

Aggregated statistics:
        Age         Salary
mean  35.0            NaN
min   25.0            NaN
max   45.0            NaN
sum    NaN  350000.000000
std    NaN   15811.388301

In [31]:
#Merge
import pandas as pd

df1 = pd.DataFrame({
    'employee_id': [1, 2, 3],
    'employee_name': ['John', 'Anna', 'Peter']
})

df2 = pd.DataFrame({
    'employee_id': [1, 2, 4],
    'employee_salary': [70000, 80000, 60000]
})

# Merging on a common column
merged_df = pd.merge(df1, df2, on='employee_id')
print(merged_df)

   employee_id employee_name  employee_salary
0            1          John            70000
1            2          Anna            80000

In [32]:
#Merge on different columns
df1 = pd.DataFrame({
    'emp_id': [1, 2, 3],
    'employee_name': ['John', 'Anna', 'Peter']
})

df2 = pd.DataFrame({
    'employee_id': [1, 2, 4],
    'employee_salary': [70000, 80000, 60000]
})

# Merging with different column names
merged_df = pd.merge(df1, df2, left_on='emp_id', right_on='employee_id')
print(merged_df)

   emp_id employee_name  employee_id  employee_salary
0       1          John            1            70000
1       2          Anna            2            80000

In [37]:
#join
import pandas as pd

# Define the first DataFrame
df1 = pd.DataFrame({
    'employee_id': [1, 2, 3],
    'employee_name': ['John', 'Anna', 'Peter']
})

# Define the second DataFrame
df2 = pd.DataFrame({
    'employee_id': [1, 2, 4],
    'employee_salary': [70000, 80000, 60000]
})

# Display the DataFrames to verify column names
print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

# Perform outer join on the 'employee_id' column
outer_merge = pd.merge(df1, df2, on='employee_id', how='outer')
print("\nOuter Join Result:")
print(outer_merge)

DataFrame 1:
   employee_id employee_name
0            1          John
1            2          Anna
2            3         Peter

DataFrame 2:
   employee_id  employee_salary
0            1            70000
1            2            80000
2            4            60000

Outer Join Result:
   employee_id employee_name  employee_salary
0            1          John          70000.0
1            2          Anna          80000.0
2            3         Peter              NaN
3            4           NaN          60000.0

In [38]:
left_merge = pd.merge(df1, df2, on='employee_id', how='left')
print("\nleft Join Result:")
print(left_merge)

left Join Result:
   employee_id employee_name  employee_salary
0            1          John          70000.0
1            2          Anna          80000.0
2            3         Peter              NaN

In [39]:
right_merge = pd.merge(df1, df2, on='employee_id', how='right')
print("\right Join Result:")
print(right_merge)

ight Join Result:
   employee_id employee_name  employee_salary
0            1          John            70000
1            2          Anna            80000
2            4           NaN            60000

In [41]:
#concatenation
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5']
})

# Concatenating along rows
concatenated_df = pd.concat([df1, df2], axis=1)
print(concatenated_df)

    A   B   A   B
0  A0  B0  A3  B3
1  A1  B1  A4  B4
2  A2  B2  A5  B5

In [42]:
#How to find duplicates
import pandas as pd

data = {
    'Name': ['John', 'Anna', 'John', 'Anna', 'Peter'],
    'Age': [28, 24, 28, 24, 35],
    'City': ['New York', 'London', 'New York', 'London', 'Berlin']
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
    Name  Age      City
0   John   28  New York
1   Anna   24    London
2   John   28  New York
3   Anna   24    London
4  Peter   35    Berlin

In [43]:
# Find duplicates in the DataFrame
duplicates = df.duplicated()
print("\nDuplicated Rows:")
print(duplicates)

Duplicated Rows:
0    False
1    False
2     True
3     True
4    False
dtype: bool

In [44]:
# Display duplicate rows
duplicate_rows = df[df.duplicated()]
print("\nDuplicate Rows:")
print(duplicate_rows)

Duplicate Rows:
   Name  Age      City
2  John   28  New York
3  Anna   24    London

In [45]:
# Remove duplicate rows
df_no_duplicates = df.drop_duplicates()
print("\nDataFrame After Removing Duplicates (Keeping First):")
print(df_no_duplicates)

DataFrame After Removing Duplicates (Keeping First):
    Name  Age      City
0   John   28  New York
1   Anna   24    London
4  Peter   35    Berlin